/*1) Ќаписать метод, который в качестве параметра принимает им€ файла.
ћетод возвращает двухмерный массив (String): имена переменных и значение.

¬ файле набор переменных указаны так:
;v=[156],ghg,hg;m=[12],tytuyr894848;vector=[qwe]; 
—уществуют правила форматировани€ текста в файле:
 - им€ переменной всегда стоит между симвоами ';' и '='
 - значение переменной всегда идет после знака '=' и заключено в квадратные кавычки
 - все что идет после квадратных кавычек до ';' €вл€ютс€ служебными символами и в данной задаче они игнорируютс€

2) ¬ мейне:
- создать массив, 
- считать с консоли им€ файла, 
- передать его в метод 1
- полученный массив передать в метод 2
*/

package week1_lesson2_03_04_15;

public class Task4 {

}
