/*Шифр Цезаря с ключом например 3.
Написать метод, который принимает имя файла и шифрует содержимое файла шифром Цезаря.
Реализовать Шифрование (каждый символ смещается по таблице символов на 3 элемента вправо А в D)
 и Дешифрование (каждый символ смещается по таблице символов на 3 элемента влево E в B)
 Например: abe15 -> cdh48
 Изначально файл содержит несколько строк. Пробеллы и переходы на следующую строку не шифруются.*/

package week1_lesson2_03_04_15;

public class Task3 {

}
